Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface.CylinderHeight Property
 Height of the cylinder along the normal direction of the CylinderBase arc.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double CylinderHeight { get; set; }
Public Property CylinderHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace